Repository: MidoriKami/DailyDuty
Catalog: DailyDuty/System/Localization/Strings.*.resx
Languages: de, ja

source: Daily
de: Täglich
ja: デイリー

source: Weekly
de: Wöchentlich
ja: ウィークリー

source: Special
de: Speziell
ja: その他

source: Test Module
de: Test Modul
ja: テストモジュール

source: Unknown
de: Unbekannt
ja: 不明

source: Incomplete
de: Unvollständig
ja: 未コンプリート

source: Unavailable
de: Nicht verfügbar
ja: 実行不可

source: Complete
de: Erledigt
ja: コンプリート

source: Suppressed
de: Unterdrückt
ja: 一時停止中

# LoginMessage
source: Send Notification Message on Login
de: Benachrichtigung beim Einloggen senden
ja: ログイン時に通知を送信する

source: Challenge Log
de: Aktuelle Agenda
ja: 攻略手帳

source: Enabled
de: Aktiviert
ja: 有効

source: Disabled
de: Deaktiviert
ja: 無効

source: Module Reset
de: Modul Zurücksetzen
ja: モジュールのリセット

source: Tasks Incomplete
de: Unvollständige Aufgaben
ja: タスクが未完了

source: Allowances Remaining
de: Verbleibende Freibriefe
ja: 残り受注権

source: Status Unknown
de: Status Unbekannt
ja: ステータス不明

source: gil Remaining
de: gil Verbleibend
ja: 残りのギル

source: In Progress
de: Im Gange
ja: 実行中

source: Custom Delivery
de: Wunschlieferung
ja: お得意様取引

source: Doman Enclave
de: Domanische Enklave
ja: ドマ町人地復興

source: Duty Roulette
de: Zufallsinhalte
ja: コンテンツルーレット

source: Mini Cactpot
de: Mini-Glückskaktor
ja: ミニ・くじテンダー

source: Fashion Report
de: Kleiderkritik
ja: ファッションチェック

source: Faux Hollows
de: Traumtafel
ja: ソーチョーの幻想盤

source: Grand Company (Provision)
de: SG (Nachschub)
ja: グランドカンパニー(補給品調達)

source: Grand Company (Squadron)
de: SG (Einsatzkommando)
ja: グランドカンパニー(小隊任務)

source: Grand Company (Supply)
de: SG (Liefereinsätze)
ja: グランドカンパニー(軍需品調達)

source: Hunt Marks (Daily)
de: Jagdlizenzen (Täglich)
ja: モブハント (毎日)

source: Hunt Marks (Weekly)
de: Jagdlizenzen (Wöchentlich)
ja: モブハント (毎週)

source: Treasure Map
de: Schatzkarte
ja: トレジャーハント

source: Jumbo Cactpot
de: Jumbo-Glückskaktor
ja: ジャンボ・くじテンダー

source: Levequest
de: Staatserlasse
ja: ギルドリーヴ

source: Masked Carnivale
de: Die große Maskerade
ja: マスクカーニバル

source: Raids (Alliance)
de: Allianz-Raids
ja: アライアンスレイド

source: Raids (Normal)
de: Normale Raids
ja: ノーマルレイド

source: Tribal Quests
de: Stammes-Quests
ja: 友好部族クエスト

source: Wondrous Tails
de: Khloes Abenteueralbum
ja: クロの空想帳

source: Notification Threshold
de: Benachrichtigungs-Grenzwert
ja: 通知のしきい値

source: Comparison Mode
de: Vergleichsmodus
ja: 比較モード

# DomanEnclaveTeleport
source: Notifications can be clicked on to teleport to the Doman Enclave
de: Benachrichtigungen können angeklickt werden, um sich in die Domanische Enklave zu teleportieren
ja: 通知をクリックするとドマ町人地にテレポできます

source: Weekly Allowance
de: Wöchentliche Zulassung
ja: 週の予算

# DonatedThisWeek
source: Donated
de: Gespendet
ja: 受け取った謝礼金

source: Less Than
de: Weniger als
ja: 未満

source: Equal To
de: Gleich
ja: 等しい

source: Less Than or Equal
de: Kleiner Gleich
ja: 以下

# All
source: All Allowances Used
de: Alle Versuche verwendet
ja: 採点を最大回数実施

# Single
source: One Allowance Used
de: Ein Versuch Verwendet
ja: 採点を1回実施

# Plus80
source: Scored 80+
de: Punktzahl 80+
ja: 80点以上

source: Default
de: Standard
ja: 既定値に戻す

source: Clickable Link
de: Anklickbarer Link
ja: クリッカブルリンク

source: Enable
de: Aktivieren
ja: 有効

source: Time Not Available
de: Zeit nicht verfügbar
ja: 利用できない時間

source: Module Enable
de: Modul aktivieren
ja: モジュールの有効化

source: Notification Options
de: Benachrichtigungsoptionen
ja: 通知オプション

source: NotificationCustomization
de: Benachrichtigungs-Anpassungen
ja: 通知のカスタマイズ

source: Enable Custom Reset Message
de: Benutzerdefinierte Reset-Nachricht aktivieren
ja: カスタムリセットメッセージを有効にする

source: Reset Message
de: Nachricht zurücksetzen
ja: リセットメッセージ

source: Status Message
de: Statusmeldung
ja: ステータスメッセージ

source: Enable Custom Status Message
de: Benutzerdefinierte Status-Nachricht aktivieren
ja: カスタムステータスメッセージを有効にする

source: Enable Custom Channel
de: Benutzerdefinierten Kanal aktivieren
ja: カスタムチャンネルを有効にする

source: Send Status on Login
de: Status bei Anmeldung senden
ja: ログイン時にステータスを送信する

source: Send Status on Zone Change
de: Status beim Gebietswechsel senden
ja: エリア移動後にステータスを送信する

source: Send Message on Reset
de: Status beim Zurücksetzen senden
ja: リセット時にメッセージを送信する

# SendStatusOnLoginHelp
source: Sends a status notification to chat when you login
de: Sendet beim Anmelden eine Statusbenachrichtigung an den Chat
ja: ログイン時にチャットにステータス通知を送信します

# SendStatusOnZoneChangeHelp
source: Sends a status notification to chat when you change zones Limited to once per 5 mins
de: Sendet eine Statusbenachrichtigung im Chat, wenn du Zonen wechselst Auf einmal pro 5 Minuten limitiert
ja: エリア移動後にチャットにステータス通知を送信します 5分ごとに1回に制限されます

# SendMessageOnResetHelp
source: Sends a notification to chat if a reset recently occured
de: Sendet eine Benachrichtigung an den Chat, wenn kürzlich ein Zurücksetzen stattgefunden hat
ja: 最近リセットされた場合にチャットに通知を送信します

source: Next Reset
de: Nächste Zurücksetzung
ja: 次のリセット

source: Remaining Time
de: Verbleibende Zeit
ja: 残り時間

source: Awaiting User Action
de: Warten auf Benutzeraktion
ja: ユーザーアクション待ち

source: Task Selection
de: Aufgabenauswahl
ja: タスクの選択

source: Nothing to Track
de: Nichts zu beobachten
ja: 追跡するものがありません

source: Task Data
de: Aufgabendaten
ja: タスクの状況

source: ModuleStatus
de: Modul Status
ja: モジュールのステータス

source: Current Status
de: Aktueller Status
ja: 現在のステータス

source: Module Suppression
de: Modul Unterdrückung
ja: モジュールの一時停止

# ModuleSuppressionHelp
source: Silence notifications until the next module reset
de: Benachrichtigungen bis zum nächsten Modulrücksetzen stumm schalten
ja: 次のモジュールのリセットまで通知を非表示にする

source: Snooze
de: Schlummern
ja: スヌーズ

source: UnSnooze
de: Schlummern aus
ja: スヌーズ解除

source: Todo Display Enable
de: Todo-Anzeige aktivieren
ja: Todo表示の有効化

source: Current Color
de: Aktuelle Farbe
ja: 現在の色

source: Close
de: Schließen
ja: 閉じる

# DutyRouletteOpenDutyFinder
source: Notifications can be clicked on to open the Duty Finder
de: Benachrichtigungen können angeklickt werden, um die Inhaltssuche zu öffnen
ja: 通知をクリックするとコンテンツファインダーを開けます

source: Complete When Tomecapped
de: Erledigt, wenn Steinobergrenze erreicht
ja: トームストーンが上限に達したときにコンプリートとする

# CompleteWhenTomeCappedHelp
source: Marks task as complete when you are at the tomestone weekly limit
de: Markiert die Aufgabe als erledigt, wenn du am Allaganstein-Wochenlimit bist
ja: 週制限に達したときにタスクをコンプリートとみなす

source: Current Weekly Tomestones
de: Aktuelle wöchentliche Allagansteine
ja: 今週の取得数

# WeeklyTomestoneLimit
source: Weekly Limit
de: Wöchentliches Limit
ja: 週制限

# AtWeeklyTomestoneLimit
source: Weekly Limit Reached
de: Wöchentliches Limit erreicht
ja: 週制限に達している

source: Budget Remaining
de: Verbleibendes Budget
ja: 残りの予算

source: Roulettes Remaining
de: Verbleibende Zufallsinhalte
ja: 残りのルーレット

source: Completion Mode
de: Abschluss Modus
ja: コンプリート判定モード

# GoldSaucerTeleport
source: Notifications can be clicked on to teleport to the Gold Saucer
de: Benachrichtigungen können angeklickt werden, um zum Gold Saucer zu teleportieren
ja: 通知をクリックするとゴールドソーサーにテレポできます

# HighestWeeklyScore
source: Highest Score
de: Höchste Bewertung
ja: 最高得点

source: Fashion Report Available
de: Kleiderkritik verfügbar
ja: ファッションチェックに参加可能

source: Allowances Available
de: Verbleibende Versuche
ja: 受注権が利用可能

source: Highest Score
de: Persönliche Bestleistung
ja: 最高得点

source: Include Retelling
de: Extraprüfung einschließen
ja: ボーナスチャンスを含める

# IdyllshireTeleport
source: Notifications can be clicked on to teleport to Idyllshire
de: Benachrichtigungen können angeklickt werden, um nach Frohehalde zu teleportieren
ja: 通知をクリックするとイディルシャイアにテレポできます

source: Faux Hollows Completions
de: Traumtafel Vervollständigungen
ja: ソーチョーの幻想盤コンプリート

source: Unreal Trial Available
de: Traumprüfung verfügbar
ja: 幻討滅戦に挑戦可能

source: Mission Completed
de: Mission abgeschlossen
ja: 任務完了

source: Mission Started
de: Mission gestartet
ja: 任務開始

source: Mission Complete Time
de: Mission Komplettierung Zeit
ja: 任務完了日時

source: Time Until Mission Complete
de: Zeit bis zum Abschluss der Mission
ja: 任務完了までの時間

source: Mission Available
de: Mission verfügbar
ja: 小隊任務が利用可能です

source: Hunts Remaining
de: Jagdlizenzen Verbleibend
ja: 残りのモブハント

source: Claimed Tickets
de: Beanspruchte Tickets
ja: 購入番号

source: Tickets Available
de: Verbleibende Lose
ja: くじを引き換え可能

source: Levequest Allowances
de: Freibrief Vollmachten
ja: リーヴ受注権

source: Accepted Levequests
de: Akzeptierte Freibriefe
ja: 受注したリーヴ

# UldahTeleport
source: Notifications can be clicked on to teleport to Ul'dah
de: Benachrichtigungen können angeklickt werden, um nach Ul'dah zu teleportieren
ja: 通知をクリックするとウルダハにテレポできます

source: Challenges Remaining
de: Verbleibende Herausforderungen
ja: 残りの課題

source: Tickets Remaining
de: Verbleibende Lose
ja: 残り挑戦回数

source: Raids Available
de: Raids verfügbar
ja: レイド可能

source: Last Map Gathered
de: Letzte Karte gesammelt
ja: 前回の地図採集日時

source: Map Available
de: Schatzkarte verfügbar
ja: 地図取得可能

# OpenDutyFinderToRaid
source: Notifications can be clicked on to open the Duty Finder to the Raid category
de: Benachrichtigungen können angeklickt werden, um die Inhaltssuche in der Raid-Kategorie zu öffnen
ja: 通知をクリックするとコンテンツファインダーの「レイド」カテゴリーを開けます

source: Instance Notifications
de: Instanzbenachrichtigungen
ja: インスタンス通知

# InstanceNotificationsHelp
source: When entering a duty, display if the duty needs to be rerolled, or is already available
de: Beim Betreten eines Spielinhalts, zeige an ob dieser zurückgesetzt werden muss oder bereits verfügbar ist
ja: コンテンツ突入時、「リトライ」する必要があるか、または印を獲得可能であるかを表示します

# WondrousTailsClickableLink
source: Notifications can be clicked on to open the Wondrous Tails Book or teleport to Idlyshire
de: Benachrichtigungen können angeklickt werden, um das Abenteueralbum zu öffnen oder nach Frohehalde zu teleportieren
ja: 通知をクリックすると、クロの空想帳を開くか、イディルシャイアにテレポできます

source: Sticker Available Notice
de: Aufkleber verfügbar Nachricht
ja: 印を貼付可能なときに通知する

# StickerAvailableNoticeHelp
source: When changing zones, warn if there are stickers available to claim
de: Bei Zonenänderung, warne, wenn Aufkleber noch beansprucht werden können
ja: エリア移動するとき、印を貼付可能である場合に警告します

source: Unclaimed Book Warning
de: Nicht abgeholtes Abenteueralbum Warnung
ja: 空想帳を受け取っていない場合警告する

source: Shuffle Available Notice
de: Neu Verteilung verfügbar Nachricht
ja: シャッフル可能なときに通知する

# ShuffleAvailableNoticeHelp
source: Warns when you are near the second chance limit and can shuffle your stickers
de: Warnt, wenn du in der Nähe des zweiten Chance-Limits bist und die Aufkleber neu verteilen kannst
ja: チャンスポイントが上限に近く、かつ「シャッフル」可能なときに警告します

# PlacedStickers
source: Placed Stickets
de: Platzierte Aufkleber
ja: マスに付けた印の数

source: Second Chance Points
de: Zweite Chance-Punkte
ja: チャンスポイント

source: Player Has Book
de: Spieler hat Buch
ja: 空想帳を持っている

source: Deadline
de: Gültig bis
ja: 有効期限

source: Time Remaining
de: Verbleibende Zeit
ja: 残り時間

# RerollNotice
source: This instance is available for a stamp if you re-roll it
de: Für diesen Inhalt ist ein Aufkleber erhältlich, wenn du ihn zurücksetzt
ja: このコンテンツを対象とするマスは、「リトライ」すれば未コンプリートに戻せます

# RerollsAvailable
source: You have {0} re-rolls available
de: Du hast {0} neu Verteilungen verfügbar
ja: 現在のチャンスポイント：{0}

# StampAlreadyAvailable
source: A stamp is already available for this instance
de: Für diesen Inhalt wurde bereits ein Aufkleber erhalten
ja: このコンテンツを対象とするマスは、すでに印を付けられる状態です

# CompletionAvailable
source: Completing this instance will reward you with a stamp
de: Wenn du diesen Inhalt abschließt, erhältst du einen Aufkleber
ja: このコンテンツをコンプリートすると、印を付けられます

# StampClaimable
source: You can claim a stamp for this duty!
de: Du kannst einen Aufkleber für diesen Inhalt erhalten!
ja: このコンテンツで印を付けることができます！

source: Sticker Available
de: Aufkleber verfügbar
ja: 印貼付可能

source: Shuffle Available
de: Neu Verteilung verfügbar
ja: シャッフル可能

source: New Book Available
de: Neues Buch verfügbar
ja: 新しい空想帳を取得可能

# StickersRemaining
source: {0} Stickers Remaining
de: {0} Aufkleber verfügbar
ja: {0} 個の印が残っています

source: Module Configuration
de: Modul Konfiguration
ja: モジュールの設定

# TodoEnable
source: Enable Todo Display
de: Aktiviere To-do Anzeige
ja: Todo表示を有効にする

# TodoDisable
source: Disable Todo Display
de: Deaktiviere To-do Anzeige
ja: Todo表示を無効にする

# TodoToggle
source: Toggle Todo Display
de: To-do Anzeige umschalten
ja: Todo表示を切り替える

# CannotTeleportNow
source: Cannot teleport in this situation
de: In dieser Situation kann nicht teleportiert werden
ja: この状況ではテレポできません

# TeleportingTo
source: Teleporting to '{0}'
de: Teleportiere zu {0}
ja: {0} へテレポ

# InstallTeleporterError
source: To use the teleport function, you must install the "Teleporter" plugin
de: Um die Teleport-Funktion nutzen zu können, müssen Sie das "Teleporter"-Plugin installieren
ja: テレポ機能を使用するには、"Teleporter" プラグインをインストールする必要があります

source: Teleport
ja: テレポ

# EnableDailyTasks
source: Enable Daily
de: Aktiviere Tägliche
ja: デイリータスクを表示する

# EnableWeeklyTasks
source: Enable Weekly
de: Aktiviere Wöchentliche
ja: ウィークリータスクを表示する

# EnableSpecialTasks
source: Enable Special
de: Aktiviere Spezial
ja: その他のタスクを表示する

# HideInQuestEvent
source: Hide During Quest Events
de: Verstecke während Quest-Events
ja: イベント中は非表示にする

# HideInDuties
source: Hide During Duties
de: Ausblenden während Inhalten
ja: コンテンツ中は非表示にする

source: Daily Tasks Label
de: Tägliche Aufgaben Label
ja: デイリータスクのラベル

source: Weekly Tasks Label
de: Wöchentliche Aufgaben Label
ja: ウィークリータスクのラベル

source: Special Tasks Label
de: Sonderaufgaben Label
ja: その他のタスクのラベル

source: Position
ja: 位置

source: Text Alignment
de: Textausrichtung
ja: テキストの配置

source: Line Spacing
de: Zeilenabstand
ja: 行間隔

source: Font Size
de: Schriftgröße
ja: フォントサイズ

source: Text Color
de: Textfarbe
ja: テキストの色

source: Text Border Color
de: Textrahmen Farbe
ja: テキストの輪郭の色

source: Header Outline Color
de: Kopfzeilenumrandungsfarbe
ja: ヘッダーの輪郭の色

source: Todo Display Configuration
de: To-do-Anzeige Konfiguration
ja: Todo表示の設定

source: Show All
de: Alle anzeigen
ja: すべて表示

# ModuleDataTab_TabName_Module_Data
source: Module Data
de: Moduldaten
ja: モジュールの情報

source: Module Data
de: Moduldaten
ja: モジュールの情報

source: Show Disabled
de: Deaktivierte anzeigen
ja: 無効のモジュールを表示

source: Hide Disabled
de: Deaktivierte ausblenden
ja: 無効のモジュールを非表示

source: Todo Configuration
de: To-do Konfiguration
ja: Todoの設定

# ForgotBookWarning
source: Wait! You forgot your book!
de: Warte! Du hast dein Buch vergessen!
ja: 待って！本を忘れています！

source: Near Khloe
de: In der Nähe von Khloe
ja: クロに近い

source: Distance to Khloe
de: Distanz zu Khloe
ja: クロまでの距離

# ComparisonHelp
source: Module is considered 'Complete' when the condition is met
de: Modul wird als 'Fertig' betrachtet, wenn die Bedingung erfüllt ist
ja: 条件が満たされるとモジュールは「コンプリート」とみなされます

source: Duty Name
de: Inhalts Name
ja: コンテンツ

# NumDrops
source: Target Drop Count
de: Ziel-Drop-Anzahl
ja: 目標報酬数

# RaidsModuleHelp
source: Number of drops required from this duty to be considered complete
de: Anzahl der Drops, die für diesen Inhalt erforderlich sind, um als vollständig zu gelten
ja: ここで設定した数の報酬を受領するとコンプリートとみなします

# CurrentNumDrops
source: Current Drop Count
de: Aktuelle Drop Anzahl
ja: 報酬受領済み

source: Casting Teleport
de: Teleportiert
ja: テレポ詠唱

source: Book Expired
de: Buch abgelaufen
ja: 有効期限切れ

source: Todo Display Options
de: To-do Anzeigeoptionen
ja: Todo表示オプション

source: Task Label
de: Aufgaben-Label
ja: タスクラベル
